# NoElementsAddedtoNewAssembly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..NoElementsAddedtoNewAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
No elements were added to the assembly. No assembly will be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoElementsAddedtoNewAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoElementsAddedtoNewAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoElementsAddedtoNewAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace